# Ficha de trabalho 1
1 - Considera o ficheiro **notas.csv** com a classificação de algumas disciplinas do curso de bioinformática.
Importa os dados para um objeto do tipo pandas.DataFrame

In [28]:
import pandas as pd

df = pd.read_csv("notas.csv")

print(df)

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas
0     João          12.0             16.0                17.0
1    Carla          17.0             16.0                 NaN
2    Sónia           NaN             18.0                18.0
3    Pedro          16.0              NaN                18.0
4     José          14.0             17.0                12.0
5   Carina          19.0             18.0                20.0
6    Telma          16.0             14.0                12.0
7  Joaquim           NaN             15.0                12.0
8  Ricardo          15.0             15.0                14.0
9    Vanda          16.0             15.0                18.0

2 - Ordena a informação pela ordem alfabética dos nomes.

In [5]:
df.sort_values("Nome", ascending=True)

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas
5   Carina          19.0             18.0                20.0
1    Carla          17.0             16.0                 NaN
7  Joaquim           NaN             15.0                12.0
4     José          14.0             17.0                12.0
0     João          12.0             16.0                17.0
3    Pedro          16.0              NaN                18.0
8  Ricardo          15.0             15.0                14.0
2    Sónia           NaN             18.0                18.0
6    Telma          16.0             14.0                12.0
9    Vanda          16.0             15.0                18.0

3 - Calcula a média de cada uma das disciplinas.

In [10]:
df.mean()

/tmp/ipykernel_8242/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Laboratórios          15.625000
 Alg. Avançados       16.000000
 Biologia Sistemas    15.666667
dtype: float64

4 - Seleciona o nome dos alunos com classificação igual ou superior 16 na disciplina de Laboratórios.

In [16]:
alunos = df.loc[df['Laboratórios'] >= 16, "Nome"]
print(alunos)

1     Carla
3     Pedro
5    Carina
6     Telma
9     Vanda
Name: Nome, dtype: object

5 - Cria uma nova coluna com a média de cada um dos alunos nas 3 disciplinas.

In [20]:
df['Media'] = df.mean(axis=1)

print(df)

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas      Media
0     João          12.0             16.0                17.0  15.000000
1    Carla          17.0             16.0                 NaN  16.500000
2    Sónia           NaN             18.0                18.0  18.000000
3    Pedro          16.0              NaN                18.0  17.000000
4     José          14.0             17.0                12.0  14.333333
5   Carina          19.0             18.0                20.0  19.000000
6    Telma          16.0             14.0                12.0  14.000000
7  Joaquim           NaN             15.0                12.0  13.500000
8  Ricardo          15.0             15.0                14.0  14.666667
9    Vanda          16.0             15.0                18.0  16.333333

/tmp/ipykernel_8242/2743248002.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df['Media'] = df.mean(axis=1)

6 - Considera a seguinte informação adicional.
```python
Sexo = ['M','F','F','M','M','F','F','M','M','F']
Idade = [23,21,25,21,22,23,21,20,27,21]
```
Constroi um novo DataFrame (df2) com a informação adicional dos alunos.

In [33]:
sexo = ['M','F','F','M','M','F','F','M','M','F']
idade = [23,21,25,21,22,23,21,20,27,21]
dfaux = pd.DataFrame({'Sexo' :sexo, 'Idade' :idade })
dfaux

  Sexo  Idade
0    M     23
1    F     21
2    F     25
3    M     21
4    M     22
5    F     23
6    F     21
7    M     20
8    M     27
9    F     21

7 - Compila a informação presente nos dois DataFrames (df e df2) num único DataFrame.

In [35]:
df_concat = pd.concat([df,dfaux],axis=1)
df_concat

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas Sexo  Idade
0     João          12.0             16.0                17.0    M     23
1    Carla          17.0             16.0                 NaN    F     21
2    Sónia           NaN             18.0                18.0    F     25
3    Pedro          16.0              NaN                18.0    M     21
4     José          14.0             17.0                12.0    M     22
5   Carina          19.0             18.0                20.0    F     23
6    Telma          16.0             14.0                12.0    F     21
7  Joaquim           NaN             15.0                12.0    M     20
8  Ricardo          15.0             15.0                14.0    M     27
9    Vanda          16.0             15.0                18.0    F     21

8 - A média da notas das raparigas é mais alta, em comparação com a dos rapazes, na disciplina de Biologia Sistemas?

In [51]:
filter = df_concat[[' Biologia Sistemas', 'Sexo']]
print(filter)
rapazes_bs_mean = filter[filter['Sexo'] == 'M'][' Biologia Sistemas'].mean()
raparigas_bs_mean = filter[filter['Sexo'] == 'F'][' Biologia Sistemas'].mean()
print("Raparigas: ", raparigas_bs_mean)
print("Rapazes: ", rapazes_bs_mean)

    Biologia Sistemas Sexo
0                17.0    M
1                 NaN    F
2                18.0    F
3                18.0    M
4                12.0    M
5                20.0    F
6                12.0    F
7                12.0    M
8                14.0    M
9                18.0    F
Raparigas:  17.0
Rapazes:  14.6

9 - Remove do DataFrame os alunos que têm disciplinas em atraso. Coloca o resultado em df3. Os alunos com disciplinas em atraso têm valor omisso nessa coluna.

In [57]:
idx = df_concat[['Laboratórios', ' Alg. Avançados', ' Biologia Sistemas']].dropna().index
df3 = df_concat.loc[idx]
print(idx)
print ("------------")
df3

Int64Index([0, 4, 5, 6, 8, 9], dtype='int64')
------------

      Nome  Laboratórios   Alg. Avançados   Biologia Sistemas Sexo  Idade
0     João          12.0             16.0                17.0    M     23
4     José          14.0             17.0                12.0    M     22
5   Carina          19.0             18.0                20.0    F     23
6    Telma          16.0             14.0                12.0    F     21
8  Ricardo          15.0             15.0                14.0    M     27
9    Vanda          16.0             15.0                18.0    F     21

10 - Cria uma tabela pivot que apresente a média das notas de Laboratórios agrupada por idades para ambos os sexos.

In [59]:
pivot = pd.pivot_table(df_concat, values='Laboratórios', index='Idade',columns='Sexo', aggfunc='mean')
pivot

Sexo           F     M
Idade
21     16.333333  16.0
22           NaN  14.0
23     19.000000  12.0
27           NaN  15.0

11 - Adiciona uma nova coluna que indique se o aluno tem bolsa de Mérito ou não. Para ter bolsa de Mérito o aluno não pode ter disciplinas em atraso e média tem que ser superior a 17 valores. Explora a função **apply**.

In [65]:
def tem_bolsa(row):
    if row['Media'] > 17 and pd.isna(row['Disciplina_Atraso']):
        return 'Sim'
    else:
        return 'Não'

pivot['Media'] = pivot.mean(axis=1)
pivot['Bolsa'] = pivot.apply(tem_bolsa,axis=1)
pivot

/tmp/ipykernel_8242/973140198.py:7: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pivot['Media'] = pivot.mean(axis=1)

Sexo           F     M      Media Bolsa
Idade
21     16.333333  16.0  16.166667   Não
22           NaN  14.0  14.000000   Não
23     19.000000  12.0  15.500000   Não
27           NaN  15.0  15.000000   Não